tap "1password/tap"          # 1Password CLI
tap "hashicorp/tap"          # HashiCorp tools (terraform-ls, terragrunt)
tap "jesseduffield/lazygit"  # lazygit
tap "laishulu/homebrew"      # macism (input source switcher)
tap "nikitabobko/tap"        # AeroSpace (tiling window manager)
tap "one2nc/cloudlens"       # cloudlens (AWS S3 browser TUI)
tap "oven-sh/bun"            # Bun (JavaScript runtime)
tap "tilt-dev/tap"           # Tilt (local Kubernetes dev)
tap "ubuntu/microk8s"        # MicroK8s
tap "xo/xo"                  # xo (database code generator)

brew "act"                   # run GitHub Actions locally
brew "asdf"                  # language version manager
brew "aws-iam-authenticator"
brew "openssl@3"             # dep: awscli and many others
brew "readline"              # dep: many CLIs
brew "awscli"
brew "awslogs"
brew "azure-cli"
brew "bat"                   # cat with syntax highlighting
brew "btop"                  # resource monitor
brew "glib"                  # dep: many tools
brew "cmake"                 # dep: build system
brew "delve"                 # Go debugger
brew "docker-compose"
brew "efm-langserver"        # general-purpose language server
brew "fd"                    # fast find alternative
brew "ffmpeg"
brew "fish"                  # shell
brew "fzf"                   # fuzzy finder
brew "fzy"                   # fuzzy finder (lighter alternative to fzf)
brew "gh"                    # GitHub CLI
brew "ghostscript"           # dep: PostScript/PDF interpreter
brew "git"
brew "gitlab-runner"
brew "glab"                  # GitLab CLI
brew "glow"                  # markdown renderer
brew "gnupg"                 # GPG
brew "harper"                # grammar checker language server
brew "helm"                  # Kubernetes package manager
brew "helmfile"              # declarative Helm releases
brew "helmify"               # generate Helm charts from k8s manifests
brew "ncurses"               # dep: neovim and TUI tools
brew "httpie"                # HTTP client
brew "hurl"                  # HTTP testing tool
brew "imagemagick"
brew "infracost"             # cloud cost estimation for Terraform
brew "jq"                    # JSON processor
brew "k9s"                   # Kubernetes TUI
brew "kind"                  # Kubernetes in Docker
brew "kubectx"               # kubectl context/namespace switcher
brew "kubernetes-cli"        # kubectl
brew "kustomize"             # Kubernetes config customization
brew "lazydocker"            # Docker TUI
brew "lazygit"               # git TUI
brew "libpq"                 # PostgreSQL client library
brew "logcli"                # Loki log query CLI
brew "lpeg"                  # dep: neovim
brew "luajit"                # dep: neovim
brew "luarocks"              # dep: neovim
brew "luv"                   # dep: neovim
brew "macos-trash", link: true
brew "mas"                   # Mac App Store CLI
brew "midnight-commander"    # file manager TUI
brew "tree-sitter"           # dep: neovim
brew "utf8proc", args: ["HEAD"] # dep: neovim / git
brew "neovim"
brew "pg_top"                # PostgreSQL process viewer
brew "pgcli"                 # PostgreSQL CLI with autocomplete
brew "pkgconf"               # dep: build tool
brew "pngpaste"              # paste images from clipboard to file
brew "postgresql@17", restart_service: :changed
brew "pre-commit"
brew "protobuf"              # dep: protocol buffers
brew "pspg"                  # pager for psql / tabular data
brew "python@3.12"           # dep: many tools
brew "redis", restart_service: :changed
brew "revive"                # Go linter
brew "ripgrep"               # fast grep
brew "rsync"
brew "ruby"                  # dep: many tools
brew "ruby-build"            # dep: Ruby version installer
brew "rust"                  # dep: some tools
brew "rustup"                # Rust toolchain manager
brew "sentry-cli"
brew "starship"              # shell prompt
brew "stow"                  # symlink manager (used for dotfiles)
brew "terraform-ls"          # Terraform language server
brew "terragrunt"            # Terraform wrapper
brew "tilt"                  # local Kubernetes dev tool
brew "tmate"                 # terminal sharing
brew "tmux"                  # terminal multiplexer
brew "tree"                  # directory tree viewer
brew "tree-sitter-cli"       # tree-sitter grammar compiler
brew "twm"                   # workspace manager
brew "uv"                    # fast Python package manager
brew "wget"
brew "wtf"                   # terminal dashboard
brew "wxwidgets"             # dep: GUI toolkit
brew "yazi"                  # file manager TUI
brew "zk"                    # Zettelkasten note-taking CLI
brew "zoxide"                # smarter cd (also used by wezterm plugin)
brew "laishulu/homebrew/macism" # input source switcher
brew "one2nc/cloudlens/cloudlens" # AWS S3 browser TUI
brew "oven-sh/bun/bun"       # Bun JavaScript runtime
brew "tilt-dev/tap/ctlptl"   # local Kubernetes cluster manager

cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace" # tiling window manager
cask "alfred"                # launcher
cask "bartender"             # menu bar organizer
cask "bruno"                 # API client
cask "caffeine"              # prevent sleep
cask "choosy"                # browser picker
cask "claude"
cask "cleanmymac"
cask "cleanshot"             # screenshot tool
cask "cyberduck"             # file transfer (S3, FTP, etc.)
cask "daisydisk"             # disk space analyzer
cask "docker-desktop"
cask "fanny"                 # fan control menu bar app
cask "figma"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fork"                  # git GUI
cask "gemini"                # duplicate file finder
cask "godot"                 # game engine
cask "google-chrome@dev"
cask "gpg-suite"
cask "hyperwhisper"          # voice transcription
cask "ilya-birman-typography-layout" # typography keyboard layout
cask "input-source-pro"      # input source switcher
cask "keyboardcleantool"     # disable keyboard for cleaning
cask "keyclu"                # keyboard shortcut cheat sheet
cask "linear-linear"         # project management
cask "loom"                  # screen recording
cask "macdown"               # markdown editor
cask "meetingbar"            # calendar meetings in menu bar
cask "microsoft-auto-update" # dep: Microsoft apps updater
cask "microsoft-edge"
cask "microsoft-teams"
cask "ngrok"                 # tunnel localhost to internet
cask "notion"
cask "obsidian"              # note-taking
cask "philips-hue-sync"
cask "popclip"               # text selection popup actions
cask "postman"               # API client
cask "refine"                # Refine dev tools
cask "slack"
cask "surfshark"             # VPN
cask "tailscale-app"         # VPN / private network
cask "teamviewer"            # remote desktop
cask "telegram"
cask "vlc"                   # media player
cask "wezterm"               # terminal
cask "wireshark-app"         # network analyzer
cask "zen"                   # Firefox-based browser
cask "zoom"

mas "1Blocker", id: 1365531024          # ad & tracker blocker
mas "1Password for Safari", id: 1569813296
mas "Developer", id: 640199958          # Apple Developer app
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MoneyWiz", id: 1511185140          # personal finance
mas "Numbers", id: 361304891
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696             # task manager
